/**
 * Цикли
 *
 * - Цикл for
 * - Відлік від 0 до N
 * - Обратний відлік від N до 0
 * - Збільшення/зменшення лічильника на 2+
 * - Інкремент і декремент
 * - Цикли while
 */

//* цикл - це спеціальна конструкція яка дозволяє вам виконувати один і тей самий код багато разів, часто використувається для перебору якогось набору даних

//* цикл for використовується тоді, коли ви точно знаєте кількість ітерацій (одне виконання циклу)

/*
for(ініціалізація внутрішніх змінних; умова продовження циклу; пост вираз) {
    тіло циклу
}
*/

// console.log("Before");

// for (let i = 0; i <= 2; i += 1) {
//   console.log(i);
// }

/*
1. for (let i = 0; 0 <= 2; i += 1) {
     console.log(0);
    }
2. for (i = 1; 1 <= 2; i += 1) {
     console.log(1);
    }
3. for (i = 2; 2 <= 2; i += 1) {
     console.log(2);
    }
4. for (i = 3; 3 <= 2; i += 1) // кінець! бо умова 3 <= 2 це фолс
*/

// console.log("After");

/**
 * -------------------------------
 */

// console.log("Before");

// for (let i = 10; i >= 2; i -= 2) {
//   console.log(i);
// }

// console.log("After");

/**
 * -------------------------------
 */

// const min = 100;
// const max = 1000;

// // знайти суму усіх цілих чисел від min до max включно

// function getSumOfRange(min, max) {
//   if (min >= max) {
//     console.log("Некоректно задано діапазон!");
//     return 0;
//   }
//   /*
//     1. Оголосити змінну накопичувач (куди ми будемо додавати усі числа)
//     2. запустити цикл від мін до макс з кроком 1, додаючи кожне значення до накопичувача
//     */

//   let sum = 0;

//   for (let i = min; i <= max; i += 1) {
//     sum += i;
//   }

//   return sum;
// }

// console.log(
//   `Сума цілих чисел в діапазоні [${min}, ${max}] рівна ${getSumOfRange(
//     min,
//     max
//   )}`
// );

/**
 * -------------------------------
 */

// let a = 10;
// let b = a++; // let b = a(10) -> a += 1
// // ++a - спочатку додає одиницю, а потім повертає значення (вже оновлене)
// // a++ - спочатку повертає значення (старе), а потім додає одиницю

// console.log(a); // 11
// console.log(b); // 10

// let c = 10;
// let d = ++c; // c += 1 -> c = 11, let d = c(11)

// console.log(c);
// console.log(d);

/**
 * -------------------------------
 */

//* while(умова) - це цикл, який використовується в тих випадках, коли ви не знаєте точну кількість ітерацій, але вам треба виконувати певний код, допоки умова буде істиною

// console.log("Before while loop");

// let counter = 0;

// while (counter < 10) {
//   console.log("Ітерація циклу, значення", counter);
//   counter += 1;
// }
// console.log("Result", counter);

// console.log("After while loop");

// const CORRECT_PASSWORD = "1111";

// let userPassword = prompt("Введіть пароль:");

// while (userPassword.trim() !== CORRECT_PASSWORD) {
//   userPassword = prompt("Пароль введено не вірно, спробуйте ще раз:");
// }

// alert("Раді вас бачити!");

// for (let i = 0; i <= 10; i += 1) {
//   if (i === 5) {
//     break; // оператор який моментально зупинить виконання циклу і код нижче (в тілі циклу) виконуватись не буде
//   }
//   console.log(i);
// }

// for (let i = 0; i <= 10; i += 1) {
//   if (i === 5) {
//     continue; // оператор який пропускає поточну ітерацію(ви відразу переходите на наступну ітерацію)
//   }
//   console.log(i);
// }
