/**
 * Ітерація по масиву
 *
 * - Ітерація по масиву циклом for
 * - Цикл for...of
 * - Різниця у використанні for и for...of
 */

const friends = ["Mango", "Kiwi", "Poly", "Ajax"];

// console.table(friends);

// for (let i = 0; i < friends.length; i += 1) {
//   friends[i] += `-${i}`;
//   console.log(i, friends[i]);
// }

// console.table(friends);

// використовуємо тоді, коли нам не потрібно працювати з індексами у циклі, перебираємо відразу дані. Сам цикл фор оф створений для того щоб перебрати значення набору даних
// for (const friend of friends) {
//   console.log(friend);
// }

/**
 * Напиши скрипт для обчислення площі прямокутника зі сторонами,
 * значення яких зберігаються у змінній values у вигляді рядка.
 * Значення гарантовано розділені пробілом.
 */

const values = "8 11";

function calculateRecSquare(values) {
  /*
  1. витягнути з рядка окремо ширину і окремо висоту, це можна зробити за допомогою методу split(" ")
  2. оскільки це рядок, а нам треба робити математичні обчилення - перетворюємо значення на числа Number()
  3. обчислити площу (повернути результат обчислень)
  */

  const sides = values.split(" ");
  const width = Number(sides[0]);
  const height = Number(sides[1]);

  return width * height;
}

// console.log(calculateRecSquare(values));

/**
 * Напиши скрипт для перебору масиву fruits.
 * Для кожного елемента масиву виведи в консоль рядок
 * у форматі номер_елемента: значення_елемента.
 * Нумерація елементів повинна починатися з 1.
 */

const fruits = ["🍎", "🍇", "🍑", "🍌", "🍋"];
/*
1: 🍎
2: 🍇
3: 🍑
4: 🍌
5: 🍋
*/

// for (let i = 0; i < fruits.length; i += 1) {
//   console.log(`${i + 1}: ${fruits[i]}`);
// }
