/**
 * Напиши цикл for, який виводить у консоль браузера
 * числа за зростанням від a до b, але тільки якщо число кратне 5.
 */

// const min = 20;
// const max = 100;

// function logMultiplesNumbersFromRange(min, max, multiple) {
//   // ця функція буде виводити в консоль всі числа від min до max які кратні (діляться націло) значенню multiple

//   // запускаємо цикл від 20 до 100 з кроком 1
//   for (let i = min; i <= max; i += 1) {
//     // робимо перевірку, виводити значення в консоль ми будемо тільки при умові якщо поточне число буде націло ділитись на multiple(5). Тобто, якщо число буде кратне значенню multiple
//     if (i % multiple === 0) {
//       console.log(i);
//     }
//   }
// }

// logMultiplesNumbersFromRange(min, max, 5);
// console.log("=========");
// logMultiplesNumbersFromRange(min, max, 10);

/*
 * Напиши скрипт, який підраховує суму всіх парних чисел,
 * які входять в діапазон чисел у змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в ньому два парних числа - 2 і 4, їх сума 6.
 */

const min = 0;
const max = 10;
let total = 0;

/*
1. запускаємо цикл в діапазоні від мін до макс з кроком 1
    1.1. робимо перевірку на парність числа (i % 2 === 0)
    1.2. якщо число парне - додаємо його до змінної накопичувача total
*/

for (let i = min; i <= max; i += 1) {
  if (i % 2 === 0) {
    total += i;
  }
}

console.log(
  `Сума всіх парних чисел в діапазоні [${min}, ${max}] рівна ${total}`
);
